<template>
  <div class="container">
    <TheMain />
    <TheExperience />
    <TheContacts />
  </div>
</template>

<script>
export default {
  mounted() {
    this.$i18n.locale = 'ru';
  },
  setup() {
    useSeoMeta({
      title: 'Федянов Степан – Фронтенд-разработчик | Резюме',
      ogTitle: 'Федянов Степан – Фронтенд-разработчик | Резюме',
      description:
        'Занимаюсь фронтенд-разработкой с 2019 года. Два года работал на фрилансе, участвовал в разработке крупных проектах, а также доработкой и рефакторингом существующих решений у клиентов. В свободное от работы время занимаюсь спортом, читаю.',
      ogDescription:
        'Занимаюсь фронтенд-разработкой с 2019 года. Два года работал на фрилансе, участвовал в разработке крупных проектах, а также доработкой и рефакторингом существующих решений у клиентов. В свободное от работы время занимаюсь спортом, читаю.',
      ogImage: '/ogImage.png',
      twitterCard: 'summary_large_image',
    });
  },
};
</script>
